export const BASE_URL = "https://shikimori.one/api";
export const SITE_URL = "https://shikimori.one";

export const HEADERS = {
  "User-Agent": "AnimePlatform/2.0 (Client-ID: AnixStream)",
  "Accept": "application/json"
};


export const NSFW_GENRE_IDS = [12, 33, 34]; 

export const GENRES_MAP: Record<string, string> = {
  "Экшен": "1",
  "Приключения": "2",
  "Комедия": "4",
  "Драма": "8",
  "Фэнтези": "10",
  "Магия": "16",
  "Ужасы": "14",
  "Детектив": "7",
  "Романтика": "22",
  "Фантастика": "24",
  "Повседневность": "36",
  "Спорт": "30",
  "Триллер": "41",
  "Исекай": "543",
  "Сёнэн": "27",
  "Сэйнэн": "42",
  "Сёдзё": "25",
  "Дзёсэй": "43",
  "Музыка": "19",
  "Психология": "40",
  "Сверхъестественное": "37",
 
  "Пародия": "20",
  "Этти": "9",
  "Меха": "18",
  "Школа": "23",
  "Гарем": "35",
  "Исторический": "13",
  "Военное": "38",
  "Демоны": "6",
  "Боевые искусства": "17",
  "Детское": "15",
  "Космос": "29",
  "Вампиры": "32",
  "Игры": "11", 
  "Полиция": "39",
  "Самураи": "21",
  "Супер сила": "31",
  "Безумие": "5",
  "Машины": "3"
};